In [1]:
import pandas as pd

In [2]:
# key:value 쌍으로 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data= {'a':1,'b':2,'c':3}
# Pandas Series() 함수로 dictionary를 Series로 변환.
sr = pd.Series(dict_data)

print(type(sr))
print('\n')
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

In [4]:
# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [5]:
# 인덱스 배열은 변수 idx에 저장. 데이터 값 배열은 변수 val에 저장
idx = sr.index
print(idx)

RangeIndex(start=0, stop=5, step=1)

In [6]:
val = sr.values
print(val)

['2019-01-02' 3.14 'ABC' 100 True]

In [7]:
# 튜플을 시리즈로 변환(인덱스 옵션 지정)
tup_data = ('영인','2010-05-01','여',True)
sr = pd.Series(tup_data, index=['이름','생년월일','성별','학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [8]:
print(sr[0])  # sr의 1번째 원소를 선택(정수형 위치 인덱스)
print(sr['이름'])  # '이름' 라벨을 가진 원소를 선택 (인덱스 이름)

영인
영인

In [9]:
# 여러 개의 원소를 선택 (인덱스 리스트 활용)
print(sr[[1,2]])
print('\n')
print(sr[['생년월일','성별']])

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [10]:
print(sr[1:2])
print('\n')
print(sr['생년월일':'성별'])

생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [11]:
import pandas as pd

In [12]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df = pd.DataFrame(dict_data)

In [13]:
print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [14]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])

In [16]:
print(type(df))
print('\n')
print(df.index)
print('\n')
print(df.columns)
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


Index(['준서', '예은'], dtype='object')


Index(['나이', '성별', '학교'], dtype='object')


    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [17]:
df.index=['학생1','학생2']
df.columns=['연령','남녀','소속']

In [18]:
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [20]:
df.rename(index={'준서':'학생1','예은':'학생2'}, inplace=True)

In [21]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [22]:
exam_data = {'수학':[90,80,70],'영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,90]}

In [24]:
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [27]:
# DataFrame df를 복제하여 변수 df2에 저장. df2의 1개 행(row) 삭제
df2 = df[:]
df2.drop('우현', inplace=True)
df2

C:\Users\광운MOOC센터\AppData\Local\Temp\ipykernel_10032\1105074967.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현', inplace=True)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [29]:
df3 = df[:]
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

C:\Users\광운MOOC센터\AppData\Local\Temp\ipykernel_10032\3497585996.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['우현','인아'], axis=0, inplace=True)

    수학  영어  음악   체육
서준  90  98  85  100

In [30]:
exam_data = {'수학':[90,80,70],'영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,90]}

In [31]:
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [32]:
df4 = df[:]
df4.drop('수학', axis=1, inplace=True)
df4

C:\Users\광운MOOC센터\AppData\Local\Temp\ipykernel_10032\1940238519.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('수학', axis=1, inplace=True)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [33]:
df5 = df[:]
df5.drop(['영어','음악'], axis=1, inplace=True)
print(df5)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

C:\Users\광운MOOC센터\AppData\Local\Temp\ipykernel_10032\562566504.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(['영어','음악'], axis=1, inplace=True)

In [34]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [37]:
label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [38]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준','우현']]
position2 = df.iloc[[0,1]]
print(label2)
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [39]:
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]
print(label3)
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100

In [40]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(exam_data)

In [41]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [42]:
math1 = df['수학']
math1

0    90
1    80
2    70
Name: 수학, dtype: int64

In [43]:
music_gym = df[['음악','체육']]
music_gym

    음악   체육
0   85  100
1   95   90
2  100   90

In [44]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(exam_data)

In [46]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [47]:
df.set_index('이름', inplace=True)

In [48]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [52]:
c = df.loc['서준',['수학','음악']]

In [53]:
c

수학    90
음악    85
Name: 서준, dtype: int64

In [55]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(exam_data)

In [56]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [58]:
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [59]:
df.loc[4] = ['동규','80','70','60','50']

In [61]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  80  70   60   50

In [63]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(exam_data)

# '이름'열을 새로운 인덱스로 지정.
df.set_index('이름', inplace=True)

# df의 특정 원소를 변경  >>> 서준의 체육 점수 변경
df.loc['서준','체육'] = 80

In [65]:
df.iloc[1,1] = 80

In [67]:
df.iloc[2][1] = 70  # 하나의 대괄호 안에 안 쓰고 둘로 나눠도 됨.

In [68]:
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  80   95  90
인아  70  70  100  90

In [69]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(exam_data)

df = df.T  # transpose를 줄여서 대문자 T로 활용.

In [70]:
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [73]:
# 행 인덱스 재배열

# 딕셔너리 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔너리 데이터프레임으로 변환. 인덱스를 [r0,r1,r2]로 지정.
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])

# 인덱스를 [r0,r1,r2,r3,r4]로 재지정
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index)

# reindex로 발생한 nan값 숫자 0으로 치환
ndf.fillna(0, inplace=True)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  0.0  0.0  0.0   0.0   0.0
r4  0.0  0.0  0.0   0.0   0.0

In [76]:
# 인덱스 초기화
ndf.reset_index(inplace=True)
ndf

  index   c0   c1   c2    c3    c4
0    r0  1.0  4.0  7.0  10.0  13.0
1    r1  2.0  5.0  8.0  11.0  14.0
2    r2  3.0  6.0  9.0  12.0  15.0
3    r3  0.0  0.0  0.0   0.0   0.0
4    r4  0.0  0.0  0.0   0.0   0.0

In [77]:
# 딕셔너리 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔너리를 데이터프레임으로 변환. 인덱스는 [r0,r1,r2]
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])

# 내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [78]:
# 딕셔너리 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔너리를 데이터프레임으로 변환. 인덱스는 [r0,r1,r2]
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])

# c1 열을 기준으로 내림차순 정렬
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [79]:
# 연산

# 라이브러리 불러오기
import pandas as pd
import numpy as np

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

# 두 학생의 과목별 점수로 사칙연산 수행
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1/student2

# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 >> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division], index=['덧셈','뺄셈','곱셈','나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [80]:
result.fillna(0, inplace=True)

In [81]:
result

      국어        수학   영어
덧셈   0.0   170.000  0.0
뺄셈   0.0    10.000  0.0
곱셈   0.0  7200.000  0.0
나눗셈  0.0     1.125  0.0

In [82]:
# 데이터프레임끼리 더하기

# 라이브러리
import pandas as pd
import seaborn as sns

# titanic dataset에서 age,fare 2개 열을 가져오기
titanic = sns.load_dataset('titanic')
df = titanic[['age','fare']]

# 데이터프레임에 숫자 10 더하기
addition = df+10

# 데이터프레임끼리 연산
subtraction = addition - df
print(subtraction.tail())

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0